<a href="https://colab.research.google.com/github/bofori-tech/DS-Unit-3-Sprint-2-SQL-and-Databases/blob/master/buddymove_holidayiq_py.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [61]:
import pandas as pd

In [62]:
!wget https://archive.ics.uci.edu/ml/machine-learning-databases/00476/buddymove_holidayiq.csv

--2020-11-16 02:45:55--  https://archive.ics.uci.edu/ml/machine-learning-databases/00476/buddymove_holidayiq.csv
Resolving archive.ics.uci.edu (archive.ics.uci.edu)... 128.195.10.252
Connecting to archive.ics.uci.edu (archive.ics.uci.edu)|128.195.10.252|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 7566 (7.4K) [application/x-httpd-php]
Saving to: ‘buddymove_holidayiq.csv.2’

buddymove_holidayiq 100%[===================>]   7.39K  --.-KB/s    in 0s

2020-11-16 02:45:55 (125 MB/s) - ‘buddymove_holidayiq.csv.2’ saved [7566/7566]

In [81]:
df = pd.read_csv('buddymove_holidayiq.csv')
df

      User Id  Sports  Religious  Nature  Theatre  Shopping  Picnic
0      User 1       2         77      79       69        68      95
1      User 2       2         62      76       76        69      68
2      User 3       2         50      97       87        50      75
3      User 4       2         68      77       95        76      61
4      User 5       2         98      54       59        95      86
..        ...     ...        ...     ...      ...       ...     ...
244  User 245      18        139     148      129       129     168
245  User 246      22        114     228      104        84     168
246  User 247      20        124     178      104       158     174
247  User 248      20        133     149      139       144     213
248  User 249      20        143     149      139       159     143

[249 rows x 7 columns]

In [64]:
import sqlite3

In [82]:
conn = sqlite3.connect('buddymove_holidayiq.sqlite3')

In [83]:
df.to_sql('Review', conn, if_exists='replace')

/usr/local/lib/python3.6/dist-packages/pandas/core/generic.py:2615: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  method=method,

In [85]:
cur=conn.cursor()

In [86]:
query = """
SELECT * FROM Review"""

In [90]:
cur.execute(query)

In [91]:
df = pd.read_sql(query, conn)
df

     index   User Id  Sports  Religious  Nature  Theatre  Shopping  Picnic
0        0    User 1       2         77      79       69        68      95
1        1    User 2       2         62      76       76        69      68
2        2    User 3       2         50      97       87        50      75
3        3    User 4       2         68      77       95        76      61
4        4    User 5       2         98      54       59        95      86
..     ...       ...     ...        ...     ...      ...       ...     ...
244    244  User 245      18        139     148      129       129     168
245    245  User 246      22        114     228      104        84     168
246    246  User 247      20        124     178      104       158     174
247    247  User 248      20        133     149      139       144     213
248    248  User 249      20        143     149      139       159     143

[249 rows x 8 columns]

In [94]:
query = """
SELECT COUNT(Sports)
FROM Review"""

In [95]:
cur.execute(query)

In [96]:
result_list = cur.fetchall()
result_list

[(249,)]